/******************** (C) COPYRIGHT 2026 *****************************************
   * @author      Clomol
   * @date        2026-2027
   * @brief       锟斤拷锟斤拷锟斤拷锟斤拷冢锟斤拷锟斤拷系统时锟接★拷通锟脚接口★拷执锟斤拷锟斤拷锟酵凤拷锟斤拷模锟斤拷锟绞硷拷锟斤拷锟?   *              锟斤拷锟斤拷 while(1) 锟叫碉拷锟斤拷遥锟斤拷锟斤拷锟斤拷锟斤拷位锟斤拷协锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟?   * @license     [z]锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷诮锟窖э拷锟斤拷锟斤拷目锟侥ｏ拷未锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟缴ｏ拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷业锟斤拷途
   *              This project is released under the MIT License.
   * @note        USART2 锟斤拷锟斤拷锟斤拷位锟斤拷锟斤拷锟斤拷锟斤拷协锟介，默锟较诧拷要锟节该达拷锟斤拷锟斤拷锟斤拷谋锟斤拷锟斤拷锟斤拷锟较拷锟?   * @warning     锟睫改筹拷始锟斤拷顺锟斤拷时锟斤拷确锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷系锟斤拷锟斤拷锟斤拷 CAN 锟斤拷始锟斤拷应锟斤拷锟节憋拷锟斤拷锟斤拷/IMU锟斤拷锟斤拷锟斤拷始锟斤拷锟斤拷
*********************************************************************************/
#include "stm32f10x.h"
#include "function.h"

/***************************************************************************************************
 * @name   main(void)
 * @brief  系统锟斤拷锟斤拷诤锟斤拷锟? * @param  锟斤拷
 * @return 锟斤拷锟斤拷锟斤拷锟斤拷虏锟斤拷锟斤拷锟? * @note   锟斤拷始锟斤拷顺锟津：伙拷锟斤拷锟斤拷锟斤拷 -> 通锟脚接匡拷 -> 锟斤拷锟狡凤拷锟斤拷锟斤拷 -> 锟斤拷时锟斤拷 -> 执锟斤拷锟斤拷默锟斤拷状态 -> 锟斤拷锟斤拷模锟介。
 ***************************************************************************************************/
int main(void)
{
    static u16 cnt1s = 0U;
    static u16 cnt30ms = 0U;
    static u16 cnt50ms = 0U;
    static u16 cnt100ms = 0U;
    static u16 cnt200ms = 0U;
    static u16 cnt300ms = 0U;
    static u16 cnt500ms = 0U;

    /********************************** 系统锟斤拷锟斤拷锟斤拷始锟斤拷 ********************************************/
    SystemInit();
    delay_init(72);

    LED_Init();
    NVIC_Configuration();

    /********************************** 通锟脚接口筹拷始锟斤拷 ********************************************/
    USART1_Init(APP_USART1_BAUD);
    USART2_Init(APP_USART2_BAUD);
    USART3_Init(APP_USART3_BAUD);
    USART4_Init(APP_UART4_BAUD);
    USART5_Init(APP_UART5_BAUD);
    SubBoard_LinkInit();

    USER_CAN1_Init();
    USER_CAN2_Init();

    /********************************** 锟藉级锟斤拷锟斤拷锟斤拷锟斤拷锟绞硷拷锟?****************************************/
    Switch_Init();
    /* ADC1_Init(); */

    /********************************** 应锟斤拷模锟斤拷锟绞硷拷锟?********************************************/
    ControlDispatcher_Init();

    Timer3_Init(10, 7199);
    Timer4_Init(500, 7199);

    SendSteer_SYNC_SetDefaultMode();
    Send_PTZ_Data();
    Encoder_Init();
    WitImu_Init();

#if APP_USART2_TEXT_DEBUG
    swgPrtUx(USART2, "\r\n Init Ok \r\n");
#endif

    while(1)
    {
        /********************************** 锟角讹拷时锟斤拷锟斤拷 ********************************************/
        ROS2_CommProc();
        FunctionProce();

        /********************************** 10ms锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷 **************************************/
        if(flag10ms)
        {
            flag10ms = 0U;
            Function_10ms();

            if(++cnt30ms >= 3U)
            {
                cnt30ms = 0U;
                Function_30ms();
            }

            if(++cnt50ms >= 5U)
            {
                cnt50ms = 0U;
                Function_50ms();
            }

            if(++cnt100ms >= 10U)
            {
                cnt100ms = 0U;
                Function_100ms();
            }

            if(++cnt200ms >= 20U)
            {
                cnt200ms = 0U;
                Function_200ms();
            }

            if(++cnt300ms >= 30U)
            {
                cnt300ms = 0U;
                Function_300ms();
            }

            if(++cnt500ms >= 50U)
            {
                cnt500ms = 0U;
                Function_500ms();
            }

            if(++cnt1s >= 100U)
            {
                cnt1s = 0U;
                Function_1s();
            }
        }
    }
}




/******************* (C) COPYRIGHT 2026 END OF FILE *****************************/


